-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3305
-- Generation Time: Jan 13, 2021 at 01:00 AM
-- Server version: 5.6.47
-- PHP Version: 5.6.40

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `vntudocs`
--

-- --------------------------------------------------------

--
-- Table structure for table `field`
--

CREATE TABLE `field` (
  `id` int(11) NOT NULL COMMENT 'Унікальний ідентифікатор документу',
  `template_name` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT 'Шаблон, якому належить поле',
  `name` varchar(255) CHARACTER SET utf8 NOT NULL COMMENT 'Ім''я поля',
  `value` text CHARACTER SET utf8 COMMENT 'Значення за замовчуванням',
  `description` text CHARACTER SET utf8 COMMENT 'Опис поля, його призначення',
  `isRequired` varchar(7) CHARACTER SET utf8 NOT NULL COMMENT 'Обов''язкове/необов''язкове поле (Так/Ні)',
  `isService` varchar(7) CHARACTER SET utf8 NOT NULL COMMENT 'Для адміна/користувача (Так/Ні)',
  `type` varchar(15) CHARACTER SET utf8 NOT NULL COMMENT 'Тип input в HTML розмітці'
) ENGINE=InnoDB DEFAULT CHARSET=utf32 COMMENT='Поля, належать конкретному шаблону, мають свої властивості';

--
-- Dumping data for table `field`
--

INSERT INTO `field` (`id`, `template_name`, `name`, `value`, `description`, `isRequired`, `isService`, `type`) VALUES
(1, 'Договір бакалавр фізична особа (МС)', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(2, 'Договір бакалавр фізична особа (МС)', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(3, 'Договір бакалавр фізична особа (МС)', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр» за скороченим терміном', 'Освітня послуга', 'Так', 'Так', 'text'),
(4, 'Договір бакалавр фізична особа (МС)', 'forma', 'Денна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(5, 'Договір бакалавр фізична особа (МС)', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(6, 'Договір бакалавр фізична особа (МС)', 'to', '30.06.2022', 'Навчання по', 'Так', 'Так', 'text'),
(7, 'Договір бакалавр фізична особа (МС)', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(8, 'Договір бакалавр фізична особа (МС)', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(9, 'Договір бакалавр фізична особа (МС)', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(10, 'Договір бакалавр фізична особа (МС)', 'kredits', '120', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(11, 'Договір бакалавр фізична особа (МС)', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(12, 'Договір бакалавр фізична особа (МС)', 'cost', '34400', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(13, 'Договір бакалавр фізична особа (МС)', 'vnesok', '17200', 'Внесок', 'Так', 'Так', 'text'),
(14, 'Договір бакалавр фізична особа (МС)', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(15, 'Договір бакалавр фізична особа (МС)', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(16, 'Договір бакалавр фізична особа (МС)', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(17, 'Договір бакалавр фізична особа (МС)', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text'),
(18, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(19, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(20, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр» за скороченим терміном', 'Освітня послуга', 'Так', 'Так', 'text'),
(21, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'forma', 'Денна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(22, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(23, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'to', '30.06.2023', 'Навчання по', 'Так', 'Так', 'text'),
(24, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(25, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(26, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(27, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'kredits', '180', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(28, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(29, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'cost', '51600', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(30, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'vnesok', '17200', 'Внесок', 'Так', 'Так', 'text'),
(31, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(32, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'number'),
(33, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(34, 'Договір бакалавр фізична особа (МС) денна 3 роки', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'number'),
(35, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(36, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(37, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр» за скороченим терміном', 'Освітня послуга', 'Так', 'Так', 'text'),
(38, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'forma', 'Заочна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(39, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(40, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'to', '30.06.2022', 'Навчання по', 'Так', 'Так', 'text'),
(41, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(42, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(43, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(44, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'kredits', '120', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(45, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(46, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'cost', '17200 ', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(47, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'vnesok', '8600', 'Внесок', 'Так', 'Так', 'text'),
(48, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(49, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'number'),
(50, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(51, 'Договір бакалавр фізична особа (МС) заочна 2 роки', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'number'),
(59, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(60, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(61, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр»', 'Освітня послуга', 'Так', 'Так', 'text'),
(62, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'forma', 'Денна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(63, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(64, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'to', '30.06.2024', 'Навчання по', 'Так', 'Так', 'text'),
(65, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(66, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(67, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(68, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'kredits', '240', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(69, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом на', 'Так', 'Так', 'text'),
(70, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'cost', '68800', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(71, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'vnesok', '17200', 'Внесок', 'Так', 'Так', 'text'),
(72, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(73, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(74, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(75, 'Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text'),
(76, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(77, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(78, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр» за скороченим терміном', 'Освітня послуга', 'Так', 'Так', 'text'),
(79, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'forma', 'Денна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(80, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(81, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'to', '30.06.2023', 'Навчання по', 'Так', 'Так', 'text'),
(82, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(83, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(84, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(85, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'kredits', '180', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(86, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(87, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'cost', '25800', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(88, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'vnesok', '8600', 'Внесок', 'Так', 'Так', 'text'),
(89, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(90, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(91, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(92, 'Договір бакалавр фізична особа (МС) заочна 3 роки', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text'),
(93, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(94, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(95, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'poslyga', 'навчання і за освітньо-професійною програмою «Бакалавр»', 'Освітня послуга', 'Так', 'Так', 'text'),
(96, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'forma', 'Заочна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(97, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(98, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'to', '30.06.2024', 'Навчання по', 'Так', 'Так', 'text'),
(99, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'Degree', 'Бакалавр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(100, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(101, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(102, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'kredits', '240', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(103, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'costOn', '14.09.2020', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(104, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'cost', '34400', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(105, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'vnesok', '8600', 'Внесок', 'Так', 'Так', 'text'),
(106, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(107, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(108, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(109, 'Договір бакалавр фізична особа (ПЗСО) заочна', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text'),
(110, 'Договір магістр фізична особа денна', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(111, 'Договір магістр фізична особа денна', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(112, 'Договір магістр фізична особа денна', 'poslyga', 'навчання і за освітньо-професійною програмою «Магістр»', 'Освітня послуга', 'Так', 'Так', 'text'),
(113, 'Договір магістр фізична особа денна', 'forma', 'Денна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(114, 'Договір магістр фізична особа денна', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(115, 'Договір магістр фізична особа денна', 'to', '31.12.2021', 'Навчання по', 'Так', 'Так', 'text'),
(116, 'Договір магістр фізична особа денна', 'mayeDiplom', '', 'Має закінчену базову вищу освіту та диплом', 'Так', 'Ні', 'text'),
(117, 'Договір магістр фізична особа денна', 'Degree', 'Магістр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(118, 'Договір магістр фізична особа денна', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(119, 'Договір магістр фізична особа денна', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(120, 'Договір магістр фізична особа денна', 'kredits', '90', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(121, 'Договір магістр фізична особа денна', 'costOn', '14.09.2020р', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(122, 'Договір магістр фізична особа денна', 'cost', '33450', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(123, 'Договір магістр фізична особа денна', 'vnesok', '22300', 'Внесок', 'Так', 'Так', 'text'),
(124, 'Договір магістр фізична особа денна', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(125, 'Договір магістр фізична особа денна', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(126, 'Договір магістр фізична особа денна', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(127, 'Договір магістр фізична особа денна', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text'),
(128, 'Договір магістр фізична особа заочна', 'zamovnyk', '', 'Замовник', 'Так', 'Ні', 'text'),
(129, 'Договір магістр фізична особа заочна', 'oderzuvachRod', '', 'Одержувач в родовому відмінку', 'Так', 'Ні', 'text'),
(130, 'Договір магістр фізична особа заочна', 'poslyga', 'навчання і за освітньо-професійною програмою «Магістр»', 'Освітня послуга', 'Так', 'Так', 'text'),
(131, 'Договір магістр фізична особа заочна', 'forma', 'Заочна форма', 'Форма навчання', 'Так', 'Так', 'text'),
(132, 'Договір магістр фізична особа заочна', 'from', '14.09.2020', 'Навчання з', 'Так', 'Так', 'text'),
(133, 'Договір магістр фізична особа заочна', 'to', '30.06.2022', 'Навчання по', 'Так', 'Так', 'text'),
(134, 'Договір магістр фізична особа заочна', 'mayeDiplom', '', 'Має закінчену базову вищу освіту та диплом', 'Так', 'Ні', 'text'),
(135, 'Договір магістр фізична особа заочна', 'Degree', 'Магістр', 'Ступінь вищої освіти', 'Так', 'Так', 'text'),
(136, 'Договір магістр фізична особа заочна', 'codeAndSpec', '', 'Код і спеціальність', 'Так', 'Ні', 'text'),
(137, 'Договір магістр фізична особа заочна', 'spec', '', 'Спеціальність', 'Так', 'Ні', 'text'),
(138, 'Договір магістр фізична особа заочна', 'kredits', '90', 'Обсяг кредитів', 'Так', 'Так', 'text'),
(139, 'Договір магістр фізична особа заочна', 'costOn', '14.09.2020р', 'Загальна вартість освітньої послуги станом  на', 'Так', 'Так', 'text'),
(140, 'Договір магістр фізична особа заочна', 'cost', '18200', 'Загальна вартість освітньої послуги', 'Так', 'Так', 'text'),
(141, 'Договір магістр фізична особа заочна', 'vnesok', '9100', 'Внесок', 'Так', 'Так', 'text'),
(142, 'Договір магістр фізична особа заочна', 'address', '', 'Місцезнаходження замовника', 'Так', 'Ні', 'text'),
(143, 'Договір магістр фізична особа заочна', 'phoneNumber', '', 'Номер телефону', 'Так', 'Ні', 'text'),
(144, 'Договір магістр фізична особа заочна', 'passport', '', 'Код паспорту', 'Так', 'Ні', 'text'),
(145, 'Договір магістр фізична особа заочна', 'id', '', 'Ідентифікаційний код', 'Так', 'Ні', 'text');

-- --------------------------------------------------------

--
-- Table structure for table `template`
--

CREATE TABLE `template` (
  `name` varchar(255) NOT NULL COMMENT 'Назва шаблону',
  `file_name` varchar(255) NOT NULL COMMENT 'Назва файлу',
  `description` text COMMENT 'Опис поля (його призначення)',
  `date` date NOT NULL COMMENT 'Дата створення шаблону'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Інформація про вже існуючі шаблони (назва, файл, опис, дата)';

--
-- Dumping data for table `template`
--

INSERT INTO `template` (`name`, `file_name`, `description`, `date`) VALUES
('Договір бакалавр фізична особа (МС)', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2020-12-25'),
('Договір бакалавр фізична особа (МС) денна 3 роки', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2020-12-25'),
('Договір бакалавр фізична особа (МС) заочна 2 роки', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2020-12-25'),
('Договір бакалавр фізична особа (МС) заочна 3 роки', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2021-01-12'),
('Договір бакалавр фізична особа (ПЗСО) денна 3 роки', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2021-01-12'),
('Договір бакалавр фізична особа (ПЗСО) заочна', 'form1a.docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Бакалавр» (за кошти фізичної особи)', '2021-01-12'),
('Договір магістр фізична особа денна', 'form1a(Mag).docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Магістр» (за кошти фізичної особи)', '2021-01-12'),
('Договір магістр фізична особа заочна', 'form1a(Mag).docx', 'Договір про навчання у Вінницькому національному технічному університеті за освітньо-професійною програмою «Магістр» (за кошти фізичної особи)', '2021-01-12');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `field`
--
ALTER TABLE `field`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `template`
--
ALTER TABLE `template`
  ADD PRIMARY KEY (`name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `field`
--
ALTER TABLE `field`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Унікальний ідентифікатор документу', AUTO_INCREMENT=163;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
